{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
         "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
         "context": [""]
        },
        {"tag": "easter egg",
         "patterns": ["who is prateek", "who is kush"],
         "responses": ["He is Randi"],
         "context": [""]
        },
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"],
         "context": [""]
        },
        {"tag": "noanswer",
         "patterns": [],
         "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
         "context": [""]
        },
        {"tag": "options",
         "patterns": ["How you could help me?", "What help you provide?", "How you can be helpful?"],
         "responses": ["I can guide you through Procurement problems, general information, procurement creation and bidding related queries","I can provide support related to following problems technical query, Procurement related query"],
         "context": [""]
        },
        {"tag": "alloted_tender",
             "patterns": ["tender id 431B67", "tender id 942B65", "tender id 937B66"],
         "responses": ["You have been alloted this tender. Go to you Home Dashboard for more tenders details"],
         "context": [""]
        },
        {"tag": "not_alloted_tender",
             "patterns": ["tender id 411B76", "tender id 983B77", "tender id 563B78"],
         "responses": ["You have not been alloted this tender. Go to you Home Dashboard to access your tenders"],
         "context": [""]
        },
        {"tag": "tender_components1",
         "patterns": ["requirement of tender id 431B67"],
         "responses": ["order comprises of hardisk and bluetooth."],
         "context": [""]
        },
        {"tag": "tender_components2",
         "patterns": ["requirement of tender id 942B65"],
         "responses": ["order comprises of 24 monitors and 3 bluetooth speakers"],
         "context": [""]
        },
        {"tag": "tender",
         "patterns": ["status of tender","where is my order","tell me the status of my tender"],
         "responses": ["Please enter with order ID"],
         "context": [""]
        },
        {"tag": "general",
         "patterns": ["what is Procurement","tell me what is Procurement"],
         "responses": ["Procurement is the method of discovering and agreeing to terms and purchasing goods, services, or other works from an external source, often with the use of a tendering or competitive bidding process. When a government agency buys goods or services through this practice, it is referred to as public procurement."],
         "context": [""]
        },
        {"tag": "esourcing",
         "patterns": ["I want to know about eSourced","what is esourcing"],
         "responses": ["eProcurement is often used in tandem with eSourcing (electronic sourcing), hich leverages  those same digital tools to capture supplier contact information, monitor and enforce vendor compliance, and integrate supplier workflows with the buyer’s software environment and process management."],
         "context": [""]
        },
        {"tag": "p2p",
         "patterns": ["What is P2P","What is procure to pay", "what is purchase to pay"],
         "responses": ["It covers all of the activities involved in purchasing goods and services from suppliers, from the creation of the initial request for purchase (RFP) and purchase order through to payment of the vendor invoice."],
         "context": [""]
        },
        {"tag": "s2p",
         "patterns": ["what is s2p","what is source to pay"],
         "responses": ["Source-to-pay is a comprehensive methodology for recording every step of the purchasing process. However, it starts even earlier in the purchasing process. With S2P, companies can actually add a new supplier (or suppliers) to their vendor list before the requisition form is created."],
         "context": [""]
        },
         {"tag": "account payable",
         "patterns": ["what is account payable?","account payable"],
         "responses": ["The financial function within a business dedicated to processing payments for goods and services."],
         "context": [""]
        },
         {"tag": "account receivable",
         "patterns": ["what is account receivable?","account receivable"],
         "responses": ["An official document creating a binding agreement between the party selling goods and services (the vendor) and the purchaser. Once an approved PO is sent to the vendor, the buyer has legally agreed to purchase the goods and services indicated on the form."],
         "context": [""]
        },
        {"tag": "help_email",
         "patterns":["help email","support mail"],
         "responses":["For any Issues or Clarifications relating to the published tenders, bidders are requested to contact the respective Tender Inviting Authority. Technical - support-eproc@nic.in. Policy Related - cppp-doe@nic.in"],
         "context": [""]
        },
        {"tag": "customer care",
         "patterns": ["Help me", "customer care"],
         "responses": ["For any technical related queries please call ar 24x7 Help Desk Number: 0120-4001 002, 0120-4001 005, 0120-6277 787. International Bidders are requested to prefix +91 as country code. Email Support: Technical - support-eproc@nic.in, Policy Related - cppp-doe@nic.in"],
         "context": [""]
        },
        {"tag": "purachase requeste",
         "patterns": ["what is pr", "what is purchase request"],
         "responses": ["Also known as a request for purchase or purchase requisition, a purchase request is the initial document created to obtain approval to purchase goods and services. Unlike a PO, it is not a binding agreement. The requestor sends the completed form to another party for approval (or, if the organization has contingencies and spending levels in place, simply forwards the completed form to purchasing based on the dollar amount involved)."],
         "context": [""]
        },
        {"tag": "Direct Procurement",
         "patterns": ["what is Direct Procurement"],
         "responses": ["All spend for raw materials, components, finished goods and services essential to creating the products sold by a company is considered direct procurement."],
         "context": [""]
        },
        {"tag": "Indirect Procurement",
         "patterns": ["what is Indirect Procurement", "wjat is the cost of doing business"],
         "responses": ["Often called “the cost of doing business,” indirect procurement covers all spend not immediately related to production, but rather those goods and services that support daily business enterprise activities."],
         "context": [""]
        },
        {"tag": "Maverick Spend",
         "patterns": ["What is Maverick Spend", "Maverick Spend"],
         "responses": ["Known by many names, including tail spend and rogue spend, maverick spend is spending that takes place outside the approved purchasing system. Often, buyers using company credit cards to make small purchases are the culprit, but occasionally more problematic issues—such as drafting a contract with a non-vetted supplier—occur. This spend is often considered “invisible spend” because its not captured in the purchasing systems database and therefore is likely to skew the companys financials"],
         "context": [""]
        },
        {"tag": "RFP",
         "patterns": ["What is Request for Proposals", "What is RFP"],
         "responses": ["It is a process where a company solicits a series of sealed bids  from interested suppliers, evaluates the bids submitted, and then follows a selection process to award the contract to the winning supplier."],
         "context": [""]
        },
        {"tag": "single source supplier",
         "patterns": ["Who is Single Source Supplier"],
         "responses": ["A vendor who provides a companys sole source of a particular good or service."],
         "context": [""]
        },
        {"tag": "SaaS",
         "patterns": ["What is SaaS","What is Software as a Service"],
         "responses": ["Many eProcurement solutions are hosted as services, rather than stored onsite in local servers. When software is delivered this way—usually via a subscription-based licensing model—its referred to as “software as a service.”"],
         "context": [""]
        },
        {"tag": "BoQ",
         "patterns": ["Can i upload boq with currencies other than Indian Rupees"],
         "responses": ["Yes. There is a separate BoQ for facilitating BoQ with International Currencies. The same is to be used while creating the BoQ. As on date, six currencies are allowed and each bidder can submit his bid with any one of the 6 foreign currencies of his choice. The rates as applicable on the date of opening will be used for comparative purposes. The system will give the indicative rates on the dates of opening and TIA has the option to override the system defined rates."],
         "context": [""]
        },
         {"tag": "server time",
         "patterns": ["What is the default Date and Time format used in the System", "Default date and time format used"],
         "responses": ["The Default date time format is Indian Standard Time (IST), Which is (GMT +5:30). The format used is DD-Mon-YYYY HH:Mi AM/PM. This standard convention is followed in all the pages."],
         "context": [""]
          }
        
   ]
}